{

    "nav1": "Home",
    "nav2": "Portfolio",
    "nav3": "Extras",
    "nav4": "Contact",
    "st1": "About",
    "st2": "Copyright Terms",
    "st3": "Articles",
    "st4": "Images",    
    "st5": "Projects",
    "st6": "Co-op",
    "st7": "Algo Trading Bot",
    "st8": "Languages",
    "views": "This site was visited:",
    "views2": "times.",
    "feedback": "GIVE YOUR FEEDBACK OR ASK A QUESTION",
    "update": "GET INFORMED ABOUT THE LATEST UPDATES",
    "subscribe": "SUBSCRIBE",
    "send": "SEND",
    "search": "Search...",
    "comment": "Message...",
    
    "greeting": "Greetings!",
    "about-itext": "My name is Kevin, and i was born in Switzerland on 1994 and i moved to Brazil after 1 year and a half, son of Brazilian mother and Portuguese father, i have relatives spreaded all around Europe and Brazil, as following, i have interest in computer programming and i also emphasize my general interests in languages. After my English got better i have had sometime learning French and Swedish, because i found it beautiful, but Russian appeard to be a more powerful language in some aspects, so i chose it. I was formed as a Technician in Radiology and worked into my father's shop for years, then i decided to migrate to IT field.",
    "about-title": "What is this site about?",
    "about-mtext": "This website is mainly about projects in the field of information technology (programming), more specifically in: C, C++, Java, Web and Android. It is with pleasure that I show you my projects and intentions. I am also interested in trading robots and languages as a hobby, which are things that are also part of the IT area. In my history with programming, I began to understand it in interspersed periods and saw concepts such as variables and conditions in Ruby from RPG Maker XP. Soon after, I started programming some bots for the Tibia game called Elf Bot, in which I dealt with general programming in the Lua language. Years later, I took a course in the C language, and that was when some more serious studies began. I read a book of 250 pages in a short time and got 10/10 on a C test. Soon after that, I started dealing with other content such as C++ and created my first project in C++ with more than 6 thousand lines of code, which worked in the IDE console. This project brought me joy because I understood that discipline and organization are needed to build a project. That's when I took an HTML course, and after that, I got involved with CSS and JavaScript (This website was made using HTML5, CSS3, JavaScript, and React). And it was Java and MySQL that made things more exciting, and it was also surprising to deal with a purely object-oriented language. After that, I started a passion for Web Browsers, such as the one I did in the Java framework, called JavaFX. So, realizing that the onset of the mobile era dealt with Java, I decided to get to know Kotlin, and it became one of my main focuses on programming. I have the perspective that any project that is developed must apply principles, and everything that is done results in lessons learned. It is through this type of notion that I shape myself, thus adapting to the posture and behaviors of colleagues and the company. I am always open to learning the syntax of programming languages, understanding lexical and semantic parameters, and existing programming methodologies. I will name a few areas where I want to develop skills or gain knowledge about and that will upgrade my capacities into my future programming. Let's start with Assembly: this programming language is on the opposite pole of more abstracted languages because it is a low-level language. It is closely related to machine language, and the usage of a low-level language is not only about movements we do through robotics, such as microprocessors, it is about basic and little things that are indispensable for an operating system, such as its drivers. It also can be part of how an IDE compiles a language through the low-level code it is written. Another thing I want to have contact with and improve is bending toward computer science foundations because it gives the programmer the apparatus for a better programming structure. Also, programming challenges such as 'LeetCode' are always useful to practice, for me into some languages like Java or C++, but the extra complexity about where a language can reach through its libraries and functions is not about to be explored too deeply without having something practical and useful. There's an importance in improving the NoSQL area and gaining knowledge about how a DB operates with certain programming languages, as it is the average SQL. I also plan to involve myself with programming close environments that simulate self-driven cars, usually in Python and C++, such as CARLA.",

    "rights": "© 2024 Kevin. All rights reserved.",
    "rights2": "Supported by: <span class='blue-text'>Halo Algo Trading</span> <img src='/public/images/halo.png' alt='Icon' class='halo' width='55' height='36' style='padding-top: 4px;'> and <span class='blue-text'>Solar Corp</span><a href='#' target='_blank'><img src='/public/images/solaricon.png' alt='Icon' class='sun' width='55' height='48' style='padding-bottom: 5px;'></i></a>",      
    "and": "and"

      
    
 

}


