{
    "nav1": "Início",
    "nav2": "Portfólio",
    "nav3": "Extras",
    "nav4": "Contato",
    "st1": "Sobre",
    "st2": "Termos de Direitos Autorais",
    "st3": "Artigos",
    "st4": "Imagens",    
    "st5": "Projetos",
    "st6": "Co-op",
    "st7": "Robôs de Investimento",
    "st8": "Línguas",
    
    "views": "Este site foi visitado:",
    "views2": "vezes.",
    "feedback": "DÊ SEU FEEDBACK OU PERGUNTE ALGO",
    "update": "FIQUE INFORMADO SOBRE OS ÚLTIMOS UPDATES",
    "subscribe": "INSCREVA-SE",
    "send": "ENVIAR",
    "search": "Pesquisar...",
    "comment": "Mensagem...",
    
    "greeting": "SAUDAÇÕES!",
    "about-atext": "Meu nome é Kevin, nasci na Suíça em 1994 e me mudei para o Brasil depois de 1 ano e meio, filho de mãe brasileira e pai português, tenho parentes espalhados por toda a Europa e Brasil, a seguir, tenho interesse em programação de computadores e também enfatizo meus interesses gerais por linguagens. Formei-me como Técnico em Radiologia e trabalhei durante anos em negócio do meu pai, então decidi migrar para a área de TI.",
    "about-title": "DO QUE SE TRATA ESTE SITE?",
    "about-btext": "Este site trata principalmente de projetos na área de tecnologia da informação (programação), mais especificamente em: C, C++, Java, Web e Android. É com prazer que vos apresento os meus projetos e intenções. Também tenho interesse em programar robôs de trading e possuo algumas linguagens como hobby, coisas que também fazem parte da área de TI. Na minha história com programação, comecei a entendê-la em períodos intercalados e vi conceitos como variáveis ​​e condições em Ruby do RPG Maker XP. Logo depois comecei a programar alguns bots para o jogo Tibia chamado Elf Bot, no qual tratei de programação geral na linguagem Lua. Anos depois, fiz um curso de linguagem C, e foi aí que começaram alguns estudos mais sérios. Li um livro de 350 páginas em pouco tempo e tirei 10/10 na prova de C. Logo depois comecei a lidar com outros conteúdos como C++ e criei meu primeiro projeto em C++ com mais de 6 mil linhas de código, que funcionava no console da IDE. Esse projeto me trouxe alegria porque entendi que para construir um projeto é preciso disciplina e organização. Foi quando fiz um curso presencial de HTML e depois me envolvi com CSS e JavaScript (este site foi feito em HTML5, CSS3, JavaScript e alguns frameworks). E foram Java e MySQL que tornaram as coisas mais interessantes, assim sendo surpreendente lidar com uma linguagem puramente orientada a objetos. Depois disso, comecei uma paixão por Web Browsers, como aquele que fiz no framework de Java, chamado JavaFX. Então, percebendo que o início da era mobile tratava de Java, resolvi conhecer Kotlin, e ele se tornou um dos meus principais focos em programação. Tenho a perspectiva de que qualquer projeto que seja desenvolvido deve-se seguir princípios, e tudo o que é feito resulta em lições aprendidas. É através deste tipo de noção que obtenho, adapto-me assim à postura e aos comportamentos e normas da empresa. Estou sempre aberto a aprender a sintaxe das linguagens de programação, entendendo os parâmetros léxicos e semânticos e as metodologias de programação existentes. Vou citar algumas áreas nas quais desejo desenvolver habilidades ou adquirir conhecimento e que irão aprimorar minhas capacidades em minha programação futura. Comecemos pelo Assembly: esta linguagem de programação está no pólo oposto das linguagens mais abstratas por ser uma linguagem de baixo nível. Está intimamente relacionado à linguagem de máquina, e o uso de uma linguagem de baixo nível não se trata apenas de movimentos que fazemos por meio da robótica, como microprocessadores, mas de coisas básicas e pequenas que são indispensáveis ​​para um sistema operacional, como seus drivers. Também pode fazer parte de como um IDE compila uma linguagem por meio do código de baixo nível em que é escrito. ARM Assembly tem uma relação direta com o baixo nível do Android e isto é interessante. Outra coisa que quero ter contato e aprimorar é me inclinar para os fundamentos da informática porque dá ao programador o aparato para uma melhor estrutura de programação. Além disso, desafios de programação como 'LeetCode' são sempre úteis para praticar, para mim em algumas linguagens como Java ou Kotlin, mas a complexidade extra sobre onde uma linguagem pode chegar através de suas bibliotecas e funções não deve ser explorada muito profundamente sem ter algo prático e útil. É importante aprimorar a área de NoSQL e adquirir conhecimento sobre como um banco de dados funciona com determinadas linguagens de programação. Também acho interessante Machine Learning na programação de ambientes próximos que simulem carros autônomos, geralmente em Python e C++, como CARLA.",
  
    "rights": "© 2024 Kevin. Todos os direitos reservados.",
    "rights2": "Apoiado por: <span class='blue-text'>Halo Algo Trading</span> <img src='/images/halo.png' alt='Icon' class='halo' width='50' height='32' style='padding-top: 4px;'> e <span class='blue-text'>Solar Corp</span><a href='#' target='_blank'><img src='/images/solaricon.png' alt='Icon' class='sun' width='50' height='42' style='padding-bottom: 5px;'></i></a>",
    "and": "e"


  }